app/controllers/planets_controller.rb

  def edit
    @planet = Planet.find(params[:id])

    if @planet.update(planet_params)
---
SELECT "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "planets" SET "kind" = ?, "updated_at" = ? WHERE "planets"."id" = ?  [["kind", "Type 13"], ["updated_at", "2020-01-14 17:38:58.030589"], ["id", 1]]

  def create
    @planet = Planet.new(planet_params)

    if @planet.save
---
INSERT INTO "planets" ("name", "kind", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Planet 1"], ["kind", "Type 1"], ["created_at", "2020-01-13 20:27:18.435605"], ["updated_at", "2020-01-13 20:27:18.435605"]]

  def show
    @planet = Planet.find(params[:id])
---
SELECT "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    Planet.destroy(params[:id])
---
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 10]]